test_task/Slotegrator/ApacheBench 02-08-22.txt
yurii@yurii-HP-Laptop-15s:~$ ab -k -c 1500 -n 10000 http://localhost:8501/
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        nginx/1.21.6
Server Hostname:        localhost
Server Port:            8501

Document Path:          /
Document Length:        1673 bytes

Concurrency Level:      1500
Time taken for tests:   15.596 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      19820000 bytes
HTML transferred:       16730000 bytes
Requests per second:    641.21 [#/sec] (mean)
Time per request:       2339.341 [ms] (mean)
Time per request:       1.560 [ms] (mean, across all concurrent requests)
Transfer rate:          1241.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   7.3      0      31
Processing:    13 1255 2631.9    395   15544
Waiting:       10 1255 2631.9    395   15544
Total:         41 1258 2636.1    395   15560

Percentage of the requests served within a certain time (ms)
  50%    395
  66%    406
  75%    458
  80%    534
  90%   3202
  95%   7776
  98%   9905
  99%  15447
 100%  15560 (longest request)